Repository: GarlandQian/mica-mac
Catalog: Sources/Mica/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# traffic.sort_ascending
source: Sort ascending
zh_hans: 升序排序

# traffic.sort_descending
source: Sort descending
zh_hans: 降序排序

# traffic.sources_empty_message
source: The controller did not report sources for this category.
zh_hans: 控制器未上报当前类别的来源。

# traffic.source_kind
source: Source type
zh_hans: 来源类型

# traffic.source_kind_all
source: All sources
zh_hans: 全部来源

# traffic.source_kind_proxy
source: Proxy sources
zh_hans: 代理来源

# traffic.source_kind_rule
source: Rule sets
zh_hans: 规则集

# traffic.start_time
source: Start
zh_hans: 开始时间

# traffic.surge_active_request
source: Surge request
zh_hans: Surge 请求

# traffic.surge_recent_request
source: Surge recent request
zh_hans: Surge 最近请求

# traffic.update_status
source: Update status
zh_hans: 更新状态

# traffic.updated_at
source: Updated
zh_hans: 更新时间

# trial.action_copy_diagnostics
source: Copy Diagnostics
zh_hans: 复制诊断

# trial.action_refresh
source: Refresh
zh_hans: 刷新

# trial.action_reload_providers
source: Reload Sources
zh_hans: 重新加载来源

# trial.action_reload_rules
source: Reload Rules
zh_hans: 重新加载规则

# trial.action_retry_test
source: Retry Test
zh_hans: 重试测试

# trial.add_or_select_controller
source: Add or select a controller
zh_hans: 添加或选择控制器

# trial.base_loaded
source: Basic data loaded from version, configs, proxies, and connections.
zh_hans: 基础数据已从 version、configs、proxies 和 connections 加载。

# trial.base_not_loaded
source: Base endpoints have not loaded current data.
zh_hans: 基础端点尚未加载当前数据。

# trial.base_snapshot
source: Basic Data Load
zh_hans: 基础数据加载

# trial.close_all_connections
source: Close All Connections
zh_hans: 关闭全部连接

# trial.connection_close
source: Connection Close
zh_hans: 关闭连接

# trial.connections_unavailable
source: Connections capability is not available; close actions stay disabled.
zh_hans: 连接能力不可用；关闭操作保持禁用。

# trial.continue_enhanced_snapshot
source: Continue to Rules and Sources
zh_hans: 继续加载规则和来源

# trial.continue_provider_update
source: Continue to Provider Update
zh_hans: 继续到来源更新

# trial.continue_test_connection
source: Continue to Test Connection
zh_hans: 继续到连接测试

# trial.copy_diagnostics
source: Copy Diagnostics
zh_hans: 复制诊断

# trial.copy_report_when_ready
source: Copy the diagnostics report when ready.
zh_hans: 准备好后复制诊断报告。

# trial.delay_test
source: Delay Test
zh_hans: 延迟测试

# trial.diagnostics_copy
source: Copy Diagnostics
zh_hans: 复制诊断

# trial.enhanced_snapshot
source: Rules and Sources
zh_hans: 规则和来源

# trial.last_copied %@
source: Last copied %@.
zh_hans: 最近复制：%@。

# trial.no_command_yet
source: No command yet
zh_hans: 还没有命令

# trial.profile
source: Profile
zh_hans: 配置

# trial.profile_missing_detail
source: No controller profile selected for this check.
zh_hans: 此检查尚未选择控制器配置。

# trial.profile_ready_detail
source: Local controller profile is selected; secrets stay on this Mac.
zh_hans: 已选择本地控制器配置；密钥保存在本机。

# trial.provider_unavailable
source: Provider capability is not available; row-level update stays disabled.
zh_hans: 来源能力不可用；行级更新保持禁用。

# trial.provider_update
source: Provider Update
zh_hans: 来源更新

# trial.proxy_group_unavailable
source: Proxy group capability is not available; delay test stays disabled.
zh_hans: 代理组能力不可用；延迟测试保持禁用。

# trial.readiness_failed
source: Failed
zh_hans: 失败

# trial.readiness_first_run
source: First Run
zh_hans: 首次运行

# trial.readiness_partial
source: Partial
zh_hans: 部分就绪

# trial.readiness_ready
source: Ready
zh_hans: 就绪

# trial.readiness_stale
source: Stale
zh_hans: 已过期

# trial.refresh_or_retry_test
source: Refresh or Retry Test
zh_hans: 刷新或重试测试

# trial.refresh_then_retry_close
source: Refresh then retry close
zh_hans: 刷新后重试关闭

# trial.reload_providers_or_refresh
source: Reload Sources or Refresh
zh_hans: 重新加载来源或刷新

# trial.reload_rules_or_providers
source: Reload Rules or Reload Sources
zh_hans: 重新加载规则或来源

# trial.retry_provider_update
source: Retry Provider Update
zh_hans: 重试来源更新

# trial.retry_test_delay
source: Retry Test Delay
zh_hans: 重试延迟测试

# trial.retry_test_or_edit
source: Retry Test or Edit Controller
zh_hans: 重试测试或编辑控制器

# trial.run_base_snapshot
source: Load Basic Data
zh_hans: 加载基础数据

# trial.state_failed
source: Failed
zh_hans: 失败

# trial.state_partial
source: Partial
zh_hans: 部分完成

# trial.state_passed
source: Passed
zh_hans: 通过

# trial.state_ready
source: Ready
zh_hans: 就绪

# trial.state_running
source: Running
zh_hans: 运行中

# trial.state_skipped
source: Skipped
zh_hans: 跳过

# trial.surge_base_loaded
source: Surge HTTP API data loaded from /v1 endpoints.
zh_hans: 已从 /v1 端点加载 Surge HTTP API 数据。

# trial.surge_provider_not_included
source: Surge provider update is not part of this adapter; use policy group controls instead.
zh_hans: Surge 来源更新不属于此适配器；请使用策略组控制。

# trial.test_connection
source: Test Connection
zh_hans: 连接测试

# trial.use_connection_confirmation
source: Use connection row confirmation
zh_hans: 使用连接行确认

# trial.use_provider_confirmation
source: Use provider row confirmation
zh_hans: 使用来源行确认

# trial.use_route_delay
source: Use policy group Test Delay
zh_hans: 使用策略组延迟测试

# trial.use_surge_kill_request
source: Use Kill Active Request in the Surge workspace; raw request IDs stay out of diagnostics exports.
zh_hans: 在 Surge 控制台使用结束活跃请求；原始请求 ID 不进入诊断。

# trial.use_surge_operations
source: Use Surge policy or request operations
zh_hans: 使用 Surge 策略或请求操作

# trial.use_surge_policy_controls
source: Use Surge policy controls
zh_hans: 使用 Surge 策略控制

# trial.use_surge_policy_test
source: Use Surge policy group Test in the Surge workspace.
zh_hans: 在 Surge 控制台使用策略组测试。

# trial.use_surge_request_confirmation
source: Use Surge request confirmation
zh_hans: 使用 Surge 请求确认

# unified.boundary_mihomo
source: mihomo-compatible external-controller operations are available after endpoint probes pass.
zh_hans: 端点探测通过后，可使用 mihomo-compatible external-controller 操作。

# unified.boundary_nikki
source: Nikki uses its mihomo-compatible external-controller; OpenWrt runtime, mixin, service, and file management stay outside Mica.
zh_hans: Nikki 只使用 mihomo-compatible external-controller；OpenWrt 运行时、mixin、服务和文件管理不属于 Mica。

# unified.boundary_openclash
source: OpenClash uses its already-enabled Clash/mihomo-compatible external-controller; LuCI, SSH, ubus, service, and firewall management stay outside Mica.
zh_hans: OpenClash 只使用已启用的 Clash/mihomo-compatible external-controller；LuCI、SSH、ubus、服务和防火墙管理不属于 Mica。

# unified.boundary_sing_box
source: sing-box is tracked as a future capability family; no sing-box API operation is wired yet.
zh_hans: sing-box 作为未来能力族展示；当前尚未接入 sing-box API 操作。

# unified.boundary_cmfa
source: CMFA uses its Clash-compatible remote controller. Cache and memory operations remain available; runtime configuration and core management stay unavailable.
zh_hans: CMFA 使用 Clash-compatible 远程控制器；缓存和内存操作可用，运行时配置与核心管理不可用。

# unified.boundary_stash
source: Stash uses its Clash-compatible remote controller with Stash-specific configuration and capability limits.
zh_hans: Stash 使用 Clash-compatible 远程控制器，并遵循 Stash 特有的配置与能力限制。

# unified.boundary_smart
source: Smart probing is readiness-only until a compatible remote controller is detected; Mica does not download, bundle, or run a local core.
zh_hans: Smart 探测在识别出兼容远程控制器前只用于就绪度判断；Mica 不会下载、内置或运行本地核心。

# unified.boundary_stash_cmfa
source: The saved Stash / CMFA hint is resolved to a concrete runtime variant before remote operations are enabled.
zh_hans: 保存的 Stash / CMFA 提示会先解析为具体运行时类型，再启用对应的远程操作。

# unified.boundary_surge
source: Surge operations use only the user-enabled HTTP API and X-Key.
zh_hans: Surge 操作只使用用户启用的 HTTP API 和 X-Key。

# unified.boundary_unknown
source: Run Test Connection to identify the remote controller before enabling operations.
zh_hans: 先运行连接测试识别远程控制器，再启用操作。

# unified.boundary_unsupported
source: This controller type has no supported remote operation path in Mica.
zh_hans: 此控制器类型在 Mica 中没有受支持的远程操作路径。

# unified.label_mihomo
source: mihomo-compatible
zh_hans: mihomo 兼容

# unified.label_nikki
source: Nikki external-controller
zh_hans: Nikki 外部控制器

# unified.label_openclash
source: OpenClash external-controller
zh_hans: OpenClash 外部控制器

# unified.label_cmfa
source: CMFA external-controller
zh_hans: CMFA 外部控制器

# unified.label_stash
source: Stash external-controller
zh_hans: Stash 外部控制器

# unified.label_smart
source: Smart probe
zh_hans: Smart 探测

# unified.label_unknown
source: Generic controller
zh_hans: 通用控制器

# unified.label_unsupported
source: Unsupported controller
zh_hans: 不支持的控制器

# workbench.actions
source: Actions
zh_hans: 操作

# workbench.configuration
source: Configuration
zh_hans: 配置

# workbench.settings
source: Settings
zh_hans: 设置

# workspace.acc_action_rail
source: Workspace next actions
zh_hans: 工作区下一步操作

# workspace.acc_picker
source: Workspace switcher
zh_hans: 工作区切换器

# workspace.action_close_all_detail
source: Ask for confirmation before closing all active mihomo-compatible connections.
zh_hans: 关闭所有 mihomo-compatible 活动连接前会先确认。

# workspace.action_copy_check_results_detail
source: Copy the current check results summary.
zh_hans: 复制当前检查结果摘要。

# workspace.action_copy_endpoint_results_detail
source: Copy endpoint test results.
zh_hans: 复制端点测试结果。

# workspace.action_copy_report_detail
source: Copy the diagnostics report in the selected app language.
zh_hans: 按当前应用语言复制诊断报告。

# workspace.action_disabled_busy
source: Wait for the current operation to finish.
zh_hans: 请等待当前操作完成。

# workspace.action_disabled_no_connections
source: No active connections are available for this action.
zh_hans: 当前没有可操作的活动连接。

# workspace.action_disabled_no_route_groups
source: No policy group is available in the current data.
zh_hans: 当前数据中没有可用的策略组。

# workspace.action_open_routing_detail
source: Inspect policy groups, current node, delay, and switching options.
zh_hans: 查看策略组、当前节点、延迟和切换选项。

# workspace.action_open_traffic_detail
source: Open connections, rules, providers, logs, and live observation.
zh_hans: 打开连接、规则、来源、日志和实时观测。

# workspace.action_rail
source: Next Actions
zh_hans: 下一步操作

# workspace.action_rail_subtitle
source: Available operations for this workspace and controller state.
zh_hans: 当前工作区和控制器状态下可执行的操作。

# workspace.action_refresh_detail
source: Load the latest real controller data without changing runtime state.
zh_hans: 加载最新真实控制器数据，不改变运行状态。

# workspace.action_test_detail
source: Validate URL, TLS, credential, JSON, and adapter readiness.
zh_hans: 验证 URL、TLS、凭据、JSON 和适配器就绪状态。

# workspace.command_menu
source: Workspace
zh_hans: 工作区

# workspace.diagnostics
source: Diagnostics
zh_hans: 诊断

# workspace.diagnostics_subtitle
source: Check endpoints, capabilities, unavailable reasons, and diagnostics reports.
zh_hans: 检查端点、能力、不可用原因和诊断报告。

# workspace.help_picker
source: Switch between Overview, Routing, Traffic, and Diagnostics workspaces.
zh_hans: 在总览、路由、流量和诊断工作区之间切换。

# workspace.overview
source: Overview
zh_hans: 总览

# workspace.overview_subtitle
source: Controller status, current mode, traffic, connections, rules, sources, and recent health.
zh_hans: 查看控制器状态、当前模式、流量、连接、规则、来源和最近健康结果。

# overview.connecting_message
source: Mica is opening the live session and loading controller data automatically.
zh_hans: Mica 正在建立实时会话并自动加载控制器数据。

# overview.connecting_title
source: Connecting to Controller
zh_hans: 正在连接控制器

# controllers.actions
source: Actions
zh_hans: 操作

# controllers.active
source: Active
zh_hans: 当前

# controllers.controller
source: Controller
zh_hans: 控制器

# controllers.count %lld
source: %lld controllers
zh_hans: %lld 个控制器

# controllers.delete_active_confirm %@ %@
source: Delete active controller “%1$@” and switch to “%2$@”?
zh_hans: 删除当前控制器“%1$@”并切换到“%2$@”？

# controllers.delete_confirm %@
source: Delete controller “%@”?
zh_hans: 删除控制器“%@”？

# controllers.delete_only_confirm %@
source: Delete the only controller “%@”?
zh_hans: 删除唯一的控制器“%@”？

# controllers.move_down
source: Move Down
zh_hans: 下移

# controllers.move_up
source: Move Up
zh_hans: 上移

# controllers.no_match_description
source: Change the search text to show controllers in their saved order.
zh_hans: 修改搜索内容后，将按保存顺序显示控制器。

# controllers.no_match_title
source: No Matching Controllers
zh_hans: 没有匹配的控制器

# controllers.search_prompt
source: Search name, endpoint, or type
zh_hans: 搜索名称、端点或类型

# controllers.subtitle
source: Saved order is preserved. Select a row to manage it; Use changes the active controller.
zh_hans: 保持保存顺序。选择行只用于管理，点击“使用”才会切换当前控制器。

# controllers.use
source: Use
zh_hans: 使用

# editor.continue_editing
source: Continue Editing
zh_hans: 继续编辑

# editor.discard_changes
source: Discard Changes
zh_hans: 放弃修改

# editor.unsaved_changes_prompt
source: This controller has unsaved changes. Discard them?
zh_hans: 当前控制器有未保存的修改。要放弃这些修改吗？

# editor.window_close_unsaved_message
source: Closing this window will permanently discard the current controller draft.
zh_hans: 关闭此窗口将永久放弃当前控制器草稿。

# editor.window_close_unsaved_title
source: Discard Unsaved Changes?
zh_hans: 要放弃未保存的修改吗？

# data.stale_count %lld
source: Stale · %lld
zh_hans: 数据已过期 · %lld

# data.stale_detail %@
source: Stale data · %@
zh_hans: 数据已过期 · %@

# workspace.picker
source: Workspace
zh_hans: 工作区

# tailscale.loading
source: Loading Tailscale status…
zh_hans: 正在加载 Tailscale 状态…

# tailscale.no_endpoints_title
source: No Tailscale Endpoints
zh_hans: 暂无 Tailscale 端点

# tailscale.no_endpoints_detail
source: The current sing-box controller did not report a Tailscale endpoint.
zh_hans: 当前 sing-box 控制器未报告 Tailscale 端点。

# tailscale.endpoint_tag
source: Endpoint Tag
zh_hans: 端点标签

# tailscale.backend_state
source: Backend State
zh_hans: 后端状态

# tailscale.network_name
source: Network Name
zh_hans: 网络名称

# tailscale.magic_dns_suffix
source: MagicDNS Suffix
zh_hans: MagicDNS 后缀

# tailscale.authentication_url
source: Authentication URL
zh_hans: 认证链接

# tailscale.key_authentication
source: Key Authentication
zh_hans: 密钥认证

# tailscale.current_device
source: Current Device
zh_hans: 当前设备

# tailscale.exit_node
source: Exit Node
zh_hans: 出口节点

# tailscale.exit_node_none
source: No Exit Node
zh_hans: 不使用出口节点

# tailscale.exit_node_candidates
source: Exit Node Selection
zh_hans: 选择出口节点

# tailscale.clear_exit_node
source: Disable Exit Node
zh_hans: 关闭出口节点

# tailscale.logout
source: Log Out
zh_hans: 退出登录

# tailscale.user_group
source: User Group
zh_hans: 用户组

# tailscale.user_id
source: User ID
zh_hans: 用户 ID

# tailscale.login_name
source: Login Name
zh_hans: 登录名

# tailscale.display_name
source: Display Name
zh_hans: 显示名称

# tailscale.profile_picture_url
source: Profile Picture URL
zh_hans: 头像链接

# tailscale.peer
source: Device
zh_hans: 设备

# tailscale.host_name
source: Host Name
zh_hans: 主机名

# tailscale.dns_name
source: DNS Name
zh_hans: DNS 名称

# tailscale.operating_system
source: Operating System
zh_hans: 操作系统

# tailscale.ip_addresses
source: IP Addresses
zh_hans: IP 地址

# tailscale.online
source: Online
zh_hans: 在线

# tailscale.active
source: Active
zh_hans: 活跃

# tailscale.can_be_exit_node
source: Can Be Exit Node
zh_hans: 可作为出口节点

# tailscale.received_bytes
source: Received Bytes
zh_hans: 已接收字节

# tailscale.transmitted_bytes
source: Transmitted Bytes
zh_hans: 已发送字节

# tailscale.key_expiry
source: Key Expiry (Raw)
zh_hans: 密钥到期时间（原始值）

# tailscale.stable_id
source: Stable ID
zh_hans: 稳定 ID

# tailscale.expired
source: Expired
zh_hans: 已过期

# tailscale.ssh_host_keys
source: SSH Host Keys
zh_hans: SSH 主机密钥

# tailscale.sharee_node
source: Shared Node
zh_hans: 共享节点

# tailscale.last_seen
source: Last Seen (Raw)
zh_hans: 最后在线时间（原始值）

# tailscale.stream_error_title
source: Tailscale Status Unavailable
zh_hans: Tailscale 状态不可用

# tailscale.stream_error_detail %@
source: The Tailscale stream failed without stopping the rest of the sing-box session: %@
zh_hans: Tailscale 状态流失败，但其余 sing-box 会话仍在运行：%@
